<!--
 * @Author: Gavin xl@ixuelei.com
 * @Date: 2022-04-24 10:02:24
 * @LastEditors: Gavin xl@ixuelei.com
 * @LastEditTime: 2023-08-10 10:33:52
 * @Description: 新闻列表
-->

<template>
  <div class="bn_news_2">
    <slot name="title">
      <h2 v-if="title" class="title">
        {{ title }}
      </h2>
    </slot>

    <Swiper
      class="swiper"
      :modules="modules"
      :slides-per-view="4"
      :space-between="20"
      :slides-per-group="3"
      :pagination="{ clickable: true }"
    >
      <SwiperSlide v-for="(item, index) in newsList" :key="index">
        <div class="box">
          <div class="img">
            <img :src="item.img" alt="" />
          </div>
          <div class="introduce">
            <span>{{ item.date }}</span>
            <h2>{{ item.title }}</h2>
            <p class="">{{ item.subTitle }}</p>
          </div>
        </div>
      </SwiperSlide>
    </Swiper>
  </div>
</template>
<script setup lang="ts">
import { Pagination, Navigation } from 'swiper'
const modules = ref([Pagination, Navigation])
defineProps({
  title: {
    type: String,
    default: ''
  },
  newsList: {
    type: Array<any>,
    required: true,
    default: (): any => {
      return [
        {
          img: 'http://upload.cyfyy.cn/2021/1116/thumb_390_250_20211116120329394.jpg',
          title: '成医附院成功举办首届“临床科研能力提升”系列高级培训班',
          date: '06-14',
          subTitle:
            '2022年4月17日，2021中国肿瘤学大会（CCO）肿瘤与微生态专委会学术年完美落下帷幕。本次会议由中国抗癌协会主'
        },
        {
          img: 'http://upload.cyfyy.cn/2021/1215/thumb_390_250_20211215053902240.jpg',
          title: '成医附院消化内科举办西南IBD区域学术交流会',
          date: '06-14',
          subTitle:
            '2022年6月11日，由成都医学院科技处主办、第一附属医院消化内科和科技处共同承办的《“临床科研能力提升”系列高级培训班》开班仪式、及第一期培训班在新都假日酒店顺利召开。本次学术活动也是向成都医学院建校75周年的隆重献礼。来自省内各大医院的60余名专家、学员齐聚新都，同时会议通过网络平台全程直播，共有200多名省内外学员线上观看了培训课程。培'
        },
        {
          img: 'http://upload.cyfyy.cn/2022/0422/thumb_390_250_20220422094724681.jpg',
          title: '消化内科肠道菌群研究成果在《Frontiers in Physiology》发表',
          date: '06-14',
          subTitle:
            '近日，我院消化内科“肠道微生物群研究中心”实验室装修工程顺利竣工，并即将投入使用。全新的实验室环境将使'
        },
        {
          img: 'http://upload.cyfyy.cn/2022/0420/thumb_390_250_20220420093503597.jpg',
          title: '消化内科研究论文在《Cell death and disease》上刊登',
          date: '06-14',
          subTitle:
            '6月18至19日，由成都医学院第一附属医院/高新医学会主办、成都医学院第一附属医院（成医附院）消化内科承办的'
        },
        {
          img: 'http://upload.cyfyy.cn/2021/1116/thumb_390_250_20211116120329394.jpg',
          title: '消化内科研究论文在《Cell death and disease》上刊登',
          date: '06-14',
          subTitle:
            '2022年6月11日，由成都医学院科技处主办、第一附属医院消化内科和科技处共同承办的《“临床科研能力提升”系列'
        },
        {
          img: 'http://upload.cyfyy.cn/2021/1215/thumb_390_250_20211215053902240.jpg',
          title: '伸进内科',
          date: '06-14',
          subTitle:
            '2022年4月17日，2021中国肿瘤学大会（CCO）肿瘤与微生态专委会学术年完美落下帷幕。本次会议由中国抗癌协会主办，有56位院士参与了不同分会场的学术活动。大会举行了第一届优秀学术成果表彰竞赛活动，旨在鼓励青年医生、科研人员参与学术交流，大会吸引了1万余人线上参与，盛况空前。入围本次竞赛的学者均来自全国各大知名院校，选手有年轻科研人员、博士'
        },
        {
          img: 'http://upload.cyfyy.cn/2022/0422/thumb_390_250_20220422094724681.jpg',
          title: '成医附院消化内科举办西南IBD区域学术交流会',
          date: '06-14',
          subTitle:
            '2022年4月17日，2021中国肿瘤学大会（CCO）肿瘤与微生态专委会学术年完美落下帷幕。本次会议由中国抗癌协会主办，有56位院士参与了不同分会场的学术活动。大会举行了第一届优秀学术成果表彰竞赛活动，旨在鼓励青年医生、科研人员参与学术交流，大会吸引了1万余人线上参与，盛况空前。入围本次竞赛的学者均来自全国各大知名院校，选手有年轻科研人员、博士'
        },
        {
          img: 'http://upload.cyfyy.cn/2022/0420/thumb_390_250_20220420093503597.jpg',
          title: '消化内科研究生在中国肿瘤学大会学术竞赛中斩获二等奖',
          date: '06-14',
          subTitle:
            '2022年4月17日，2021中国肿瘤学大会（CCO）肿瘤与微生态专委会学术年完美落下帷幕。本次会议由中国抗癌协会主办，有56位院士参与了不同分会场的学术活动。大会举行了第一届优秀学术成果表彰竞赛活动，旨在鼓励青年医生、科研人员参与学术交流，大会吸引了1万余人线上参与，盛况空前。入围本次竞赛的学者均来自全国各大知名院校，选手有年轻科研人员、博士'
        },
        {
          img: 'http://upload.cyfyy.cn/2021/1116/thumb_390_250_20211116120329394.jpg',
          title: '成医附院消化内科举办西南IBD区域学术交流会',
          date: '06-14',
          subTitle:
            '2022年4月17日，2021中国肿瘤学大会（CCO）肿瘤与微生态专委会学术年完美落下帷幕。本次会议由中国抗癌协会主办，有56位院士参与了不同分会场的学术活动。大会举行了第一届优秀学术成果表彰竞赛活动，旨在鼓励青年医生、科研人员参与学术交流，大会吸引了1万余人线上参与，盛况空前。入围本次竞赛的学者均来自全国各大知名院校，选手有年轻科研人员、博士'
        },
        {
          img: 'http://upload.cyfyy.cn/2021/1215/thumb_390_250_20211215053902240.jpg',
          title: '消化内科研究生在中国肿瘤学大会学术竞赛中斩获二等奖',
          date: '06-14',
          subTitle:
            '2022年4月17日，2021中国肿瘤学大会（CCO）肿瘤与微生态专委会学术年完美落下帷幕。本次会议由中国抗癌协会主办，有56位院士参与了不同分会场的学术活动。大会举行了第一届优秀学术成果表彰竞赛活动，旨在鼓励青年医生、科研人员参与学术交流，大会吸引了1万余人线上参与，盛况空前。入围本次竞赛的学者均来自全国各大知名院校，选手有年轻科研人员、博士'
        },
        {
          img: 'http://upload.cyfyy.cn/2022/0422/thumb_390_250_20220422094724681.jpg',
          title: '成医附院消化内科举办西南IBD区域学术交流会',
          date: '06-14',
          subTitle:
            '2022年6月11日，由成都医学院科技处主办、第一附属医院消化内科和科技处共同承办的《“临床科研能力提升”系列高级培训班》开班仪式、及第一期培训班在新都假日酒店顺利召开。本次学术活动也是向成都医学院建校75周年的隆重献礼。来自省内各大医院的60余名专家、学员齐聚新都，同时会议通过网络平台全程直播，共有200多名省内外学员线上观看了培训课程。培'
        },
        {
          img: 'http://upload.cyfyy.cn/2022/0420/thumb_390_250_20220420093503597.jpg',
          title: '成医附院消化内科举办西南IBD区域学术交流会',
          date: '06-14',
          subTitle:
            '2022年4月17日，2021中国肿瘤学大会（CCO）肿瘤与微生态专委会学术年完美落下帷幕。本次会议由中国抗癌协会主办，有56位院士参与了不同分会场的学术活动。大会举行了第一届优秀学术成果表彰竞赛活动，旨在鼓励青年医生、科研人员参与学术交流，大会吸引了1万余人线上参与，盛况空前。入围本次竞赛的学者均来自全国各大知名院校，选手有年轻科研人员、博士'
        },
        {
          img: 'http://upload.cyfyy.cn/2022/0420/thumb_390_250_20220420093503597.jpg',
          title: '消化内科研究生在中国肿瘤学大会学术竞赛中斩获二等奖',
          date: '06-14',
          subTitle:
            '2022年6月11日，由成都医学院科技处主办、第一附属医院消化内科和科技处共同承办的《“临床科研能力提升”系列高级培训班》开班仪式、及第一期培训班在新都假日酒店顺利召开。本次学术活动也是向成都医学院建校75周年的隆重献礼。来自省内各大医院的60余名专家、学员齐聚新都，同时会议通过网络平台全程直播，共有200多名省内外学员线上观看了培训课程。培'
        }
      ]
    }
  },
  option: {
    type: Object,
    default: () => {
      return {
        loop: true,
        slidesPerView: 4,
        autoplay: {
          delay: 5000,
          disableOnInteraction: true
        }
      }
    }
  }
})
</script>
